{"title":"International students sue over Trump admin revoking visas","author":"Rachel Wolf","publisher":"Fox News","date":"2024-04-29","facts":[{"content":"Lawsuits have been filed by international students against the Trump administration challenging visa revocations.","source":"article author"},{"content":"The students are arguing that the Trump administration lacked justification when canceling visas.","source":"article author"},{"content":"The Associated Press reported that students argue the administration lacked justification for visa cancellations.","source":"AP"},{"content":"Several international students' visas have been revoked, and the government is using a 1952 foreign policy statute to justify these cancellations.","source":"NBC News"},{"content":"Mahmoud Khalil, a Columbia University student involved in anti-Israel activity, was ordered by a judge to be deported, with DHS stating Khalil was not forthcoming about his organizational involvement.","source":"article author"},{"content":"DHS lists several circumstances under which visas may be revoked, including absence from the U.S for five months or longer, expulsion, unauthorized employment, and failure to enroll.","source":"article author"},{"content":"International students can maintain their legal residency status and continue their studies after visa revocation; their ability to travel is impacted.","source":"AP"},{"content":"Losing legal residency status can put students at risk of deportation.","source":"AP"},{"content":"Secretary of State Marco Rubio stated that there is no right to a student visa and that the government can cancel visas when appropriate.","source":"article author"},{"content":"Fox News Digital reached out to USCIS for comment on the lawsuits.","source":"article author"}],"judgements":[{"content":"The statement that the Trump administration 'lacked justification' appears to be based on the students' legal claims and reporting from the AP, but no definitive legal conclusion is provided.","source":"analysis"},{"content":"The article implies that the Trump administration's actions are justified under a 1952 statute, suggesting a perspective supportive of the administration's stance.","source":"analysis"},{"content":"The claim that visa cancellations sometimes are based on infractions like traffic violations, and support for Hamas is a separate concern, presents a nuanced perspective on the reasons for visa revocations.","source":"analysis"},{"content":"The assertion that the government 'reserves the right to cancel' visas reflects the legal framework and administrative stance.","source":"analysis"}],"quotes":[{"content":"There is no right to a student visa. We can cancel a student visa under the law just the same way that we can deny a student visa under the law. And we will do so in cases we find appropriate.","source":"Secretary of State Marco Rubio"}]}